[
  {
    "id": "global-tourism_topic_5",
    "fileId": "global-tourism",
    "type": "topic",
    "phrase": "carrying capacity",
    "englishDefinition": "Maximum number of visitors a location can sustain.",
    "englishExample": "Many attractions now limit visitor numbers to prevent exceeding carrying capacity.",
    "vietnameseDefinition": "Số lượng khách tối đa mà một địa điểm có thể chịu đựng.",
    "vietnameseExample": "Nhiều điểm tham quan hiện hạn chế số lượng khách để tránh vượt quá sức chứa."
  },
  {
    "id": "government-artist-support_academic_0",
    "fileId": "government-artist-support",
    "type": "academic",
    "word": "subsidize",
    "englishDefinition": "To support financially with public money.",
    "englishExample": "The government should subsidize struggling artists to preserve cultural heritage.",
    "vietnameseDefinition": "Hỗ trợ tài chính bằng ngân sách công.",
    "vietnameseExample": "Chính phủ nên trợ cấp cho các nghệ sĩ gặp khó khăn để bảo tồn di sản văn hóa."
  },
  {
    "id": "government-artist-support_academic_1",
    "fileId": "government-artist-support",
    "type": "academic",
    "word": "allocate",
    "englishDefinition": "To distribute resources for a particular purpose.",
    "englishExample": "Public funds should be allocated to essential services rather than arts.",
    "vietnameseDefinition": "Phân bổ nguồn lực cho một mục đích cụ thể.",
    "vietnameseExample": "Ngân sách công nên được phân bổ cho các dịch vụ thiết yếu thay vì nghệ thuật."
  },
  {
    "id": "government-artist-support_academic_2",
    "fileId": "government-artist-support",
    "type": "academic",
    "word": "heritage",
    "englishDefinition": "Cultural traditions and values passed down through generations.",
    "englishExample": "Government funding helps preserve our cultural heritage through the arts.",
    "vietnameseDefinition": "Truyền thống văn hóa và giá trị được truyền qua các thế hệ.",
    "vietnameseExample": "Tài trợ của chính phủ giúp bảo tồn di sản văn hóa của chúng ta thông qua nghệ thuật."
  },
  {
    "id": "government-artist-support_academic_3",
    "fileId": "government-artist-support",
    "type": "academic",
    "word": "flourish",
    "englishDefinition": "To grow or develop in a healthy way.",
    "englishExample": "The arts can only flourish with adequate financial support.",
    "vietnameseDefinition": "Phát triển hoặc tăng trưởng một cách khỏe mạnh.",
    "vietnameseExample": "Nghệ thuật chỉ có thể phát triển mạnh mẽ với sự hỗ trợ tài chính đầy đủ."
  },
  {
    "id": "government-artist-support_academic_4",
    "fileId": "government-artist-support",
    "type": "academic",
    "word": "prioritize",
    "englishDefinition": "To treat something as more important than other things.",
    "englishExample": "Governments must prioritize healthcare and education over artistic endeavors.",
    "vietnameseDefinition": "Coi trọng điều gì đó hơn những thứ khác.",
    "vietnameseExample": "Chính phủ phải ưu tiên y tế và giáo dục hơn các hoạt động nghệ thuật."
  },
  {
    "id": "government-artist-support_academic_5",
    "fileId": "government-artist-support",
    "type": "academic",
    "word": "enrich",
    "englishDefinition": "To improve or enhance the quality of something.",
    "englishExample": "The arts enrich society by promoting creativity and cultural awareness.",
    "vietnameseDefinition": "Cải thiện hoặc nâng cao chất lượng của điều gì đó.",
    "vietnameseExample": "Nghệ thuật làm phong phú xã hội bằng cách thúc đẩy sáng tạo và nhận thức văn hóa."
  },
  {
    "id": "government-artist-support_academic_6",
    "fileId": "government-artist-support",
    "type": "academic",
    "word": "taxpayer",
    "englishDefinition": "A person who pays taxes to the government.",
    "englishExample": "Many taxpayers object to funding artists with public money.",
    "vietnameseDefinition": "Người nộp thuế cho chính phủ.",
    "vietnameseExample": "Nhiều người nộp thuế phản đối việc tài trợ nghệ sĩ bằng ngân sách công."
  },
  {
    "id": "government-artist-support_academic_7",
    "fileId": "government-artist-support",
    "type": "academic",
    "word": "prosperity",
    "englishDefinition": "The state of being successful and wealthy.",
    "englishExample": "Cultural prosperity contributes to a nation's overall development.",
    "vietnameseDefinition": "Trạng thái thịnh vượng và giàu có.",
    "vietnameseExample": "Sự thịnh vượng văn hóa góp phần vào sự phát triển chung của quốc gia."
  },
  {
    "id": "government-artist-support_topic_0",
    "fileId": "government-artist-support",
    "type": "topic",
    "phrase": "cultural heritage",
    "englishDefinition": "The traditions and artistic legacy of a society.",
    "englishExample": "Government funding preserves cultural heritage for future generations.",
    "vietnameseDefinition": "Truyền thống và di sản nghệ thuật của xã hội.",
    "vietnameseExample": "Tài trợ của chính phủ bảo tồn di sản văn hóa cho các thế hệ tương lai."
  },
  {
    "id": "government-artist-support_topic_1",
    "fileId": "government-artist-support",
    "type": "topic",
    "phrase": "public funds",
    "englishDefinition": "Money from taxes used for government spending.",
    "englishExample": "Public funds should be spent on essential services, not entertainment.",
    "vietnameseDefinition": "Tiền từ thuế được sử dụng cho chi tiêu của chính phủ.",
    "vietnameseExample": "Ngân sách công nên được chi cho các dịch vụ thiết yếu, không phải giải trí."
  },
  {
    "id": "government-artist-support_topic_2",
    "fileId": "government-artist-support",
    "type": "topic",
    "phrase": "creative industries",
    "englishDefinition": "Sectors involving arts, culture, and creative production.",
    "englishExample": "Supporting artists strengthens the creative industries and economy.",
    "vietnameseDefinition": "Các ngành liên quan đến nghệ thuật, văn hóa và sản xuất sáng tạo.",
    "vietnameseExample": "Hỗ trợ nghệ sĩ củng cố các ngành công nghiệp sáng tạo và nền kinh tế."
  },
  {
    "id": "government-artist-support_topic_3",
    "fileId": "government-artist-support",
    "type": "topic",
    "phrase": "financial burden",
    "englishDefinition": "The cost or expense placed on someone.",
    "englishExample": "Arts funding creates an unnecessary financial burden on taxpayers.",
    "vietnameseDefinition": "Chi phí hoặc gánh nặng tài chính đặt lên ai đó.",
    "vietnameseExample": "Tài trợ nghệ thuật tạo ra gánh nặng tài chính không cần thiết cho người nộp thuế."
  },
  {
    "id": "government-artist-support_topic_4",
    "fileId": "government-artist-support",
    "type": "topic",
    "phrase": "free market",
    "englishDefinition": "Economic system where prices are determined by supply and demand.",
    "englishExample": "Artists should rely on the free market rather than government support.",
    "vietnameseDefinition": "Hệ thống kinh tế nơi giá cả được quyết định bởi cung và cầu.",
    "vietnameseExample": "Nghệ sĩ nên dựa vào thị trường tự do thay vì hỗ trợ của chính phủ."
  },
  {
    "id": "government-artist-support_topic_5",
    "fileId": "government-artist-support",
    "type": "topic",
    "phrase": "cultural enrichment",
    "englishDefinition": "Enhancement of society through arts and culture.",
    "englishExample": "Government support for artists provides cultural enrichment for all citizens.",
    "vietnameseDefinition": "Nâng cao chất lượng xã hội thông qua nghệ thuật và văn hóa.",
    "vietnameseExample": "Hỗ trợ của chính phủ cho nghệ sĩ mang lại sự phong phú văn hóa cho toàn thể công dân."
  },
  {
    "id": "government-funding-education_academic_0",
    "fileId": "government-funding-education",
    "type": "academic",
    "word": "public services",
    "englishDefinition": "Services provided by the government for all citizens.",
    "englishExample": "Public services like healthcare and education benefit the entire society.",
    "vietnameseDefinition": "Dịch vụ do chính phủ cung cấp cho tất cả công dân.",
    "vietnameseExample": "Các dịch vụ công như y tế và giáo dục mang lại lợi ích cho toàn xã hội."
  },
  {
    "id": "government-funding-education_academic_1",
    "fileId": "government-funding-education",
    "type": "academic",
    "word": "universal access",
    "englishDefinition": "Availability of services to everyone regardless of income.",
    "englishExample": "Universal access to healthcare ensures that no one is denied treatment due to poverty.",
    "vietnameseDefinition": "Khả năng tiếp cận dịch vụ cho mọi người bất kể thu nhập.",
    "vietnameseExample": "Khả năng tiếp cận y tế toàn dân đảm bảo rằng không ai bị từ chối điều trị do nghèo đói."
  },
  {
    "id": "government-funding-education_academic_2",
    "fileId": "government-funding-education",
    "type": "academic",
    "word": "taxpayer funding",
    "englishDefinition": "Money collected from citizens through taxes to pay for services.",
    "englishExample": "Taxpayer funding is used to support public schools and hospitals.",
    "vietnameseDefinition": "Tiền thu được từ công dân qua thuế để trả cho các dịch vụ.",
    "vietnameseExample": "Nguồn tài trợ từ người nộp thuế được sử dụng để hỗ trợ trường học và bệnh viện công."
  },
  {
    "id": "government-funding-education_academic_3",
    "fileId": "government-funding-education",
    "type": "academic",
    "word": "privatization",
    "englishDefinition": "Transfer of services from government to private companies.",
    "englishExample": "Privatization of healthcare can lead to more efficient services but higher costs.",
    "vietnameseDefinition": "Chuyển giao dịch vụ từ chính phủ sang các công ty tư nhân.",
    "vietnameseExample": "Tư nhân hóa y tế có thể dẫn đến dịch vụ hiệu quả hơn nhưng chi phí cao hơn."
  },
  {
    "id": "government-funding-education_academic_4",
    "fileId": "government-funding-education",
    "type": "academic",
    "word": "social welfare",
    "englishDefinition": "Government programs designed to support citizens' wellbeing.",
    "englishExample": "Social welfare systems aim to reduce poverty and inequality in society.",
    "vietnameseDefinition": "Các chương trình của chính phủ nhằm hỗ trợ phúc lợi của công dân.",
    "vietnameseExample": "Hệ thống phúc lợi xã hội nhằm giảm nghèo đói và bất bình đẳng trong xã hội."
  },
  {
    "id": "government-funding-education_academic_5",
    "fileId": "government-funding-education",
    "type": "academic",
    "word": "fiscal responsibility",
    "englishDefinition": "The obligation to manage public money wisely.",
    "englishExample": "Fiscal responsibility requires governments to balance spending with revenue.",
    "vietnameseDefinition": "Trách nhiệm quản lý tiền công một cách khôn ngoan.",
    "vietnameseExample": "Trách nhiệm tài chính đòi hỏi chính phủ cân bằng chi tiêu với doanh thu."
  },
  {
    "id": "government-funding-education_academic_6",
    "fileId": "government-funding-education",
    "type": "academic",
    "word": "equitable",
    "englishDefinition": "Fair and impartial treatment for all.",
    "englishExample": "An equitable healthcare system ensures that rich and poor receive similar treatment.",
    "vietnameseDefinition": "Đối xử công bằng và không thiên vị cho tất cả mọi người.",
    "vietnameseExample": "Hệ thống y tế công bằng đảm bảo rằng người giàu và người nghèo đều nhận được sự điều trị tương tự."
  },
  {
    "id": "government-funding-education_academic_7",
    "fileId": "government-funding-education",
    "type": "academic",
    "word": "subsidize",
    "englishDefinition": "To support financially with public money.",
    "englishExample": "Many governments subsidize education to make it affordable for all citizens.",
    "vietnameseDefinition": "Hỗ trợ tài chính bằng ngân sách công.",
    "vietnameseExample": "Nhiều chính phủ trợ cấp giáo dục để làm cho nó có giá cả phải chăng cho tất cả công dân."
  },
  {
    "id": "government-funding-education_topic_0",
    "fileId": "government-funding-education",
    "type": "topic",
    "phrase": "social equality",
    "englishDefinition": "Equal opportunities and treatment for all members of society.",
    "englishExample": "Government-funded education promotes social equality by giving everyone access to learning.",
    "vietnameseDefinition": "Cơ hội và đối xử bình đẳng cho tất cả thành viên xã hội.",
    "vietnameseExample": "Giáo dục được chính phủ tài trợ thúc đẩy bình đẳng xã hội bằng cách cho mọi người cơ hội tiếp cận học tập."
  },
  {
    "id": "government-funding-education_topic_1",
    "fileId": "government-funding-education",
    "type": "topic",
    "phrase": "economic efficiency",
    "englishDefinition": "Achieving maximum output with minimum waste of resources.",
    "englishExample": "Some argue that private healthcare offers better economic efficiency than government systems.",
    "vietnameseDefinition": "Đạt được sản lượng tối đa với lãng phí nguồn lực tối thiểu.",
    "vietnameseExample": "Một số người cho rằng y tế tư nhân mang lại hiệu quả kinh tế tốt hơn so với hệ thống của chính phủ."
  },
  {
    "id": "government-funding-education_topic_2",
    "fileId": "government-funding-education",
    "type": "topic",
    "phrase": "individual choice",
    "englishDefinition": "The freedom to make personal decisions.",
    "englishExample": "Critics argue that government control limits individual choice in healthcare options.",
    "vietnameseDefinition": "Quyền tự do đưa ra quyết định cá nhân.",
    "vietnameseExample": "Những người chỉ trích cho rằng sự kiểm soát của chính phủ hạn chế sự lựa chọn cá nhân trong các lựa chọn y tế."
  },
  {
    "id": "government-funding-education_topic_3",
    "fileId": "government-funding-education",
    "type": "topic",
    "phrase": "basic rights",
    "englishDefinition": "Fundamental entitlements that everyone should have.",
    "englishExample": "Many view healthcare and education as basic rights that governments must guarantee.",
    "vietnameseDefinition": "Quyền cơ bản mà mọi người đều có.",
    "vietnameseExample": "Nhiều người coi y tế và giáo dục là quyền cơ bản mà chính phủ phải đảm bảo."
  },
  {
    "id": "government-funding-education_topic_4",
    "fileId": "government-funding-education",
    "type": "topic",
    "phrase": "taxpayer burden",
    "englishDefinition": "The financial weight placed on citizens through taxation.",
    "englishExample": "Opponents worry that funding all healthcare increases the taxpayer burden significantly.",
    "vietnameseDefinition": "Gánh nặng tài chính đặt lên công dân thông qua thuế.",
    "vietnameseExample": "Những người phản đối lo ngại rằng tài trợ toàn bộ y tế làm tăng đáng kể gánh nặng cho người nộp thuế."
  },
  {
    "id": "government-funding-education_topic_5",
    "fileId": "government-funding-education",
    "type": "topic",
    "phrase": "private sector",
    "englishDefinition": "Businesses and organizations not owned by the government.",
    "englishExample": "The private sector can deliver education services more efficiently than government bureaucracies.",
    "vietnameseDefinition": "Các doanh nghiệp và tổ chức không thuộc sở hữu của chính phủ.",
    "vietnameseExample": "Khu vực tư nhân có thể cung cấp dịch vụ giáo dục hiệu quả hơn so với bộ máy quan료 chính phủ."
  },
  {
    "id": "high-rise-living_academic_0",
    "fileId": "high-rise-living",
    "type": "academic",
    "word": "accommodate",
    "englishDefinition": "To provide space or housing for people.",
    "englishExample": "High-rise buildings can accommodate more residents on limited urban land.",
    "vietnameseDefinition": "Cung cấp không gian hoặc nhà ở cho mọi người.",
    "vietnameseExample": "Các tòa nhà cao tầng có thể chứa nhiều cư dân hơn trên diện tích đất đô thị hạn chế."
  },
  {
    "id": "high-rise-living_academic_1",
    "fileId": "high-rise-living",
    "type": "academic",
    "word": "density",
    "englishDefinition": "The degree of compactness or concentration of population.",
    "englishExample": "High-rise development increases population density in city centers.",
    "vietnameseDefinition": "Mức độ tập trung hoặc dày đặc của dân số.",
    "vietnameseExample": "Phát triển nhà cao tầng làm tăng mật độ dân số ở trung tâm thành phố."
  },
  {
    "id": "high-rise-living_academic_2",
    "fileId": "high-rise-living",
    "type": "academic",
    "word": "vertical",
    "englishDefinition": "Going upward rather than outward; building up instead of spreading out.",
    "englishExample": "Vertical expansion addresses urban sprawl by building upward.",
    "vietnameseDefinition": "Phát triển theo chiều dọc thay vì lan rộng; xây cao thay vì xây rộng.",
    "vietnameseExample": "Mở rộng theo chiều dọc giải quyết vấn đề đô thị hóa bằng cách xây dựng cao lên."
  },
  {
    "id": "high-rise-living_academic_3",
    "fileId": "high-rise-living",
    "type": "academic",
    "word": "infrastructure",
    "englishDefinition": "Basic facilities and systems (roads, utilities, services) needed for functioning.",
    "englishExample": "High-rise developments require robust infrastructure to support concentrated populations.",
    "vietnameseDefinition": "Các cơ sở hạ tầng và hệ thống cơ bản (đường xá, tiện ích, dịch vụ) cần thiết để hoạt động.",
    "vietnameseExample": "Các dự án nhà cao tầng đòi hỏi cơ sở hạ tầng vững chắc để hỗ trợ dân số tập trung."
  },
  {
    "id": "high-rise-living_academic_4",
    "fileId": "high-rise-living",
    "type": "academic",
    "word": "isolate",
    "englishDefinition": "To separate or disconnect from others.",
    "englishExample": "Tower blocks can isolate residents from community interaction at ground level.",
    "vietnameseDefinition": "Tách biệt hoặc ngắt kết nối với người khác.",
    "vietnameseExample": "Các tòa tháp có thể cô lập cư dân khỏi tương tác cộng đồng ở tầng mặt đất."
  },
  {
    "id": "high-rise-living_academic_5",
    "fileId": "high-rise-living",
    "type": "academic",
    "word": "congestion",
    "englishDefinition": "Overcrowding or excessive concentration in one area.",
    "englishExample": "High-rise buildings can create severe congestion in elevators and common areas.",
    "vietnameseDefinition": "Tình trạng quá đông đúc hoặc tập trung quá mức ở một khu vực.",
    "vietnameseExample": "Các tòa nhà cao tầng có thể tạo ra tình trạng tắc nghẽn nghiêm trọng ở thang máy và khu vực chung."
  },
  {
    "id": "high-rise-living_academic_6",
    "fileId": "high-rise-living",
    "type": "academic",
    "word": "sprawl",
    "englishDefinition": "Uncontrolled expansion of urban areas into surrounding countryside.",
    "englishExample": "Building vertically reduces urban sprawl and preserves green spaces.",
    "vietnameseDefinition": "Sự mở rộng không kiểm soát của khu vực đô thị vào vùng nông thôn xung quanh.",
    "vietnameseExample": "Xây dựng theo chiều dọc làm giảm sự lan rộng đô thị và bảo tồn không gian xanh."
  },
  {
    "id": "high-rise-living_academic_7",
    "fileId": "high-rise-living",
    "type": "academic",
    "word": "amenity",
    "englishDefinition": "A useful or desirable feature or facility.",
    "englishExample": "A rooftop garden is a valuable amenity in modern high-rise buildings, providing residents with recreational space.",
    "vietnameseDefinition": "Tiện nghi hoặc cơ sở hữu ích và mong muốn.",
    "vietnameseExample": "Vườn trên sân thượng là một tiện nghi có giá trị trong các tòa nhà cao tầng hiện đại, cung cấp không gian giải trí cho cư dân."
  },
  {
    "id": "high-rise-living_topic_0",
    "fileId": "high-rise-living",
    "type": "topic",
    "phrase": "land scarcity",
    "englishDefinition": "Limited availability of usable land for development.",
    "englishExample": "In cities facing land scarcity, high-rise construction becomes essential.",
    "vietnameseDefinition": "Sự khan hiếm đất có thể sử dụng để phát triển.",
    "vietnameseExample": "Ở các thành phố đối mặt với khan hiếm đất đai, xây dựng nhà cao tầng trở nên thiết yếu."
  },
  {
    "id": "high-rise-living_topic_1",
    "fileId": "high-rise-living",
    "type": "topic",
    "phrase": "community cohesion",
    "englishDefinition": "The sense of connection and solidarity among neighbors.",
    "englishExample": "Low-rise housing typically fosters stronger community cohesion than tower blocks.",
    "vietnameseDefinition": "Cảm giác kết nối và đoàn kết giữa các hàng xóm.",
    "vietnameseExample": "Nhà ở thấp tầng thường thúc đẩy sự gắn kết cộng đồng mạnh hơn so với tòa tháp."
  },
  {
    "id": "high-rise-living_topic_2",
    "fileId": "high-rise-living",
    "type": "topic",
    "phrase": "footprint",
    "englishDefinition": "The area of ground covered by a building.",
    "englishExample": "High-rise buildings have a smaller footprint, preserving more land for parks.",
    "vietnameseDefinition": "Diện tích mặt đất được che phủ bởi một tòa nhà.",
    "vietnameseExample": "Các tòa nhà cao tầng có diện tích chiếm đất nhỏ hơn, bảo tồn nhiều đất hơn cho công viên."
  },
  {
    "id": "high-rise-living_topic_3",
    "fileId": "high-rise-living",
    "type": "topic",
    "phrase": "affordable housing",
    "englishDefinition": "Residential units priced within reach of average-income families.",
    "englishExample": "High-rise development can increase the supply of affordable housing units.",
    "vietnameseDefinition": "Các đơn vị nhà ở có giá trong tầm với của các gia đình thu nhập trung bình.",
    "vietnameseExample": "Phát triển nhà cao tầng có thể tăng nguồn cung các đơn vị nhà ở giá phải chăng."
  },
  {
    "id": "high-rise-living_topic_4",
    "fileId": "high-rise-living",
    "type": "topic",
    "phrase": "green space",
    "englishDefinition": "Parks, gardens, and natural areas within urban environments.",
    "englishExample": "Vertical construction preserves valuable green space in crowded cities.",
    "vietnameseDefinition": "Công viên, vườn và các khu vực tự nhiên trong môi trường đô thị.",
    "vietnameseExample": "Xây dựng theo chiều dọc bảo tồn không gian xanh quý giá ở các thành phố đông đúc."
  },
  {
    "id": "high-rise-living_topic_5",
    "fileId": "high-rise-living",
    "type": "topic",
    "phrase": "social isolation",
    "englishDefinition": "Lack of contact and connection with other people.",
    "englishExample": "Residents of large tower blocks sometimes experience social isolation.",
    "vietnameseDefinition": "Thiếu tiếp xúc và kết nối với người khác.",
    "vietnameseExample": "Cư dân của các tòa tháp lớn đôi khi trải qua sự cô lập xã hội."
  },
  {
    "id": "income-equality-happiness_academic_0",
    "fileId": "income-equality-happiness",
    "type": "academic",
    "word": "inequality",
    "englishDefinition": "Lack of equality or fairness in status, rights, or opportunities.",
    "englishExample": "Income inequality has widened significantly in recent decades.",
    "vietnameseDefinition": "Thiếu bình đẳng hoặc công bằng về địa vị, quyền lợi hoặc cơ hội.",
    "vietnameseExample": "Bất bình đẳng thu nhập đã mở rộng đáng kể trong những thập kỷ gần đây."
  },
  {
    "id": "income-equality-happiness_academic_1",
    "fileId": "income-equality-happiness",
    "type": "academic",
    "word": "prosperity",
    "englishDefinition": "The state of being successful and having wealth.",
    "englishExample": "Economic prosperity does not automatically translate to happiness.",
    "vietnameseDefinition": "Trạng thái thành công và giàu có.",
    "vietnameseExample": "Sự thịnh vượng kinh tế không tự động dẫn đến hạnh phúc."
  },
  {
    "id": "income-equality-happiness_academic_2",
    "fileId": "income-equality-happiness",
    "type": "academic",
    "word": "redistribution",
    "englishDefinition": "The distribution of something in a different way.",
    "englishExample": "Wealth redistribution through taxation can reduce income gaps.",
    "vietnameseDefinition": "Phân phối điều gì đó theo cách khác.",
    "vietnameseExample": "Phân phối lại của cải thông qua thuế có thể giảm khoảng cách thu nhập."
  },
  {
    "id": "income-equality-happiness_academic_3",
    "fileId": "income-equality-happiness",
    "type": "academic",
    "word": "wellbeing",
    "englishDefinition": "The state of being comfortable, healthy, and happy.",
    "englishExample": "Social wellbeing involves more than just financial security.",
    "vietnameseDefinition": "Trạng thái thoải mái, khỏe mạnh và hạnh phúc.",
    "vietnameseExample": "Phúc lợi xã hội bao gồm nhiều hơn là chỉ an ninh tài chính."
  },
  {
    "id": "income-equality-happiness_academic_4",
    "fileId": "income-equality-happiness",
    "type": "academic",
    "word": "disparity",
    "englishDefinition": "A great difference between things.",
    "englishExample": "The disparity between rich and poor creates social tensions.",
    "vietnameseDefinition": "Sự chênh lệch lớn giữa các vấn đề.",
    "vietnameseExample": "Sự chênh lệch giữa người giàu và người nghèo tạo ra căng thẳng xã hội."
  },
  {
    "id": "income-equality-happiness_academic_5",
    "fileId": "income-equality-happiness",
    "type": "academic",
    "word": "cohesion",
    "englishDefinition": "Unity and togetherness within a group.",
    "englishExample": "Income equality promotes social cohesion and reduces resentment.",
    "vietnameseDefinition": "Sự đoàn kết và gắn bó trong nhóm.",
    "vietnameseExample": "Bình đẳng thu nhập thúc đẩy sự gắn kết xã hội và giảm bất bình."
  },
  {
    "id": "income-equality-happiness_academic_6",
    "fileId": "income-equality-happiness",
    "type": "academic",
    "word": "incentive",
    "englishDefinition": "Something that motivates or encourages action.",
    "englishExample": "Large income differences provide incentives for hard work and innovation.",
    "vietnameseDefinition": "Điều gì đó thúc đẩy hoặc khuyến khích hành động.",
    "vietnameseExample": "Sự chênh lệch thu nhập lớn tạo động lực cho làm việc chăm chỉ và đổi mới."
  }
]
