[
  {
    "id": "work-social-life_topic_1",
    "fileId": "work-social-life",
    "type": "topic",
    "phrase": "office friendships",
    "englishDefinition": "Personal relationships developed in workplace settings.",
    "englishExample": "Office friendships can make daily work more enjoyable and less stressful.",
    "vietnameseDefinition": "Mối quan hệ cá nhân phát triển trong môi trường làm việc.",
    "vietnameseExample": "Tình bạn văn phòng có thể làm cho công việc hàng ngày trở nên thú vị hơn và ít căng thẳng hơn."
  },
  {
    "id": "work-social-life_topic_2",
    "fileId": "work-social-life",
    "type": "topic",
    "phrase": "hobby groups",
    "englishDefinition": "Communities formed around shared recreational interests.",
    "englishExample": "Joining hobby groups allows people to meet others with similar passions.",
    "vietnameseDefinition": "Cộng đồng được hình thành xung quanh sở thích giải trí chung.",
    "vietnameseExample": "Tham gia các nhóm sở thích cho phép mọi người gặp gỡ những người có đam mê tương tự."
  },
  {
    "id": "work-social-life_topic_3",
    "fileId": "work-social-life",
    "type": "topic",
    "phrase": "shared interests",
    "englishDefinition": "Common hobbies, values, or passions between people.",
    "englishExample": "Friendships based on shared interests tend to be more meaningful.",
    "vietnameseDefinition": "Sở thích, giá trị hoặc đam mê chung giữa mọi người.",
    "vietnameseExample": "Tình bạn dựa trên sở thích chung có xu hướng có ý nghĩa hơn."
  },
  {
    "id": "work-social-life_topic_4",
    "fileId": "work-social-life",
    "type": "topic",
    "phrase": "professional obligations",
    "englishDefinition": "Duties and responsibilities related to work.",
    "englishExample": "Social interactions at work may be influenced by professional obligations.",
    "vietnameseDefinition": "Nhiệm vụ và trách nhiệm liên quan đến công việc.",
    "vietnameseExample": "Tương tác xã hội tại nơi làm việc có thể bị ảnh hưởng bởi nghĩa vụ nghề nghiệp."
  },
  {
    "id": "work-social-life_topic_5",
    "fileId": "work-social-life",
    "type": "topic",
    "phrase": "diverse perspectives",
    "englishDefinition": "Different viewpoints and experiences from varied backgrounds.",
    "englishExample": "Meeting people outside work exposes you to diverse perspectives.",
    "vietnameseDefinition": "Quan điểm và kinh nghiệm khác nhau từ nhiều nguồn gốc đa dạng.",
    "vietnameseExample": "Gặp gỡ mọi người ngoài công việc cho bạn tiếp xúc với nhiều quan điểm khác nhau."
  },
  {
    "id": "working-hours-success_academic_0",
    "fileId": "working-hours-success",
    "type": "academic",
    "word": "productivity",
    "englishDefinition": "The effectiveness of productive effort measured in terms of output per unit of input.",
    "englishExample": "High productivity often matters more than long working hours for economic success.",
    "vietnameseDefinition": "Hiệu quả của nỗ lực sản xuất được đo bằng sản lượng trên mỗi đơn vị đầu vào.",
    "vietnameseExample": "Năng suất cao thường quan trọng hơn giờ làm việc dài cho thành công kinh tế."
  },
  {
    "id": "working-hours-success_academic_1",
    "fileId": "working-hours-success",
    "type": "academic",
    "word": "work ethic",
    "englishDefinition": "The principle that hard work is intrinsically valuable and worthy.",
    "englishExample": "A strong work ethic does not necessarily require extremely long hours.",
    "vietnameseDefinition": "Nguyên tắc rằng làm việc chăm chỉ là có giá trị nội tại và xứng đáng.",
    "vietnameseExample": "Đạo đức làm việc tốt không nhất thiết yêu cầu giờ làm việc cực kỳ dài."
  },
  {
    "id": "working-hours-success_academic_2",
    "fileId": "working-hours-success",
    "type": "academic",
    "word": "economic output",
    "englishDefinition": "The total value of goods and services produced by an economy.",
    "englishExample": "Economic output depends on multiple factors beyond working hours.",
    "vietnameseDefinition": "Tổng giá trị hàng hóa và dịch vụ được sản xuất bởi một nền kinh tế.",
    "vietnameseExample": "Sản lượng kinh tế phụ thuộc vào nhiều yếu tố ngoài giờ làm việc."
  },
  {
    "id": "working-hours-success_academic_3",
    "fileId": "working-hours-success",
    "type": "academic",
    "word": "work-life balance",
    "englishDefinition": "The equilibrium between professional work and personal life.",
    "englishExample": "Countries prioritizing work-life balance often maintain strong economic performance.",
    "vietnameseDefinition": "Sự cân bằng giữa công việc chuyên nghiệp và cuộc sống cá nhân.",
    "vietnameseExample": "Các quốc gia ưu tiên cân bằng công việc-cuộc sống thường duy trì hiệu suất kinh tế mạnh."
  },
  {
    "id": "working-hours-success_academic_4",
    "fileId": "working-hours-success",
    "type": "academic",
    "word": "efficiency",
    "englishDefinition": "Achieving maximum productivity with minimum wasted effort or expense.",
    "englishExample": "Efficiency improvements can boost economic success without extending working hours.",
    "vietnameseDefinition": "Đạt được năng suất tối đa với nỗ lực hoặc chi phí lãng phí tối thiểu.",
    "vietnameseExample": "Cải thiện hiệu quả có thể thúc đẩy thành công kinh tế mà không cần kéo dài giờ làm việc."
  },
  {
    "id": "working-hours-success_academic_5",
    "fileId": "working-hours-success",
    "type": "academic",
    "word": "burnout",
    "englishDefinition": "Physical or mental collapse caused by overwork or stress.",
    "englishExample": "Excessive working hours can lead to burnout, reducing overall productivity.",
    "vietnameseDefinition": "Sự suy sụp về thể chất hoặc tinh thần do làm việc quá sức hoặc căng thẳng.",
    "vietnameseExample": "Giờ làm việc quá mức có thể dẫn đến kiệt sức, giảm năng suất tổng thể."
  },
  {
    "id": "working-hours-success_academic_6",
    "fileId": "working-hours-success",
    "type": "academic",
    "word": "sustainable",
    "englishDefinition": "Able to be maintained at a certain rate or level over time.",
    "englishExample": "Sustainable economic growth requires balanced working practices.",
    "vietnameseDefinition": "Có thể duy trì ở tốc độ hoặc mức độ nhất định theo thời gian.",
    "vietnameseExample": "Tăng trưởng kinh tế bền vững đòi hỏi thực hành làm việc cân bằng."
  },
  {
    "id": "working-hours-success_academic_7",
    "fileId": "working-hours-success",
    "type": "academic",
    "word": "correlation",
    "englishDefinition": "A mutual relationship between two or more things.",
    "englishExample": "There is no clear correlation between working hours and economic prosperity.",
    "vietnameseDefinition": "Mối quan hệ lẫn nhau giữa hai hoặc nhiều thứ.",
    "vietnameseExample": "Không có mối tương quan rõ ràng giữa giờ làm việc và thịnh vượng kinh tế."
  },
  {
    "id": "working-hours-success_topic_0",
    "fileId": "working-hours-success",
    "type": "topic",
    "phrase": "hourly productivity",
    "englishDefinition": "The amount of output produced per hour worked.",
    "englishExample": "Hourly productivity is often higher in countries with shorter working weeks.",
    "vietnameseDefinition": "Lượng sản lượng được tạo ra trên mỗi giờ làm việc.",
    "vietnameseExample": "Năng suất theo giờ thường cao hơn ở các quốc gia có tuần làm việc ngắn hơn."
  },
  {
    "id": "working-hours-success_topic_1",
    "fileId": "working-hours-success",
    "type": "topic",
    "phrase": "labor market efficiency",
    "englishDefinition": "How effectively a labor market matches workers with jobs.",
    "englishExample": "Labor market efficiency contributes more to economic success than raw working hours.",
    "vietnameseDefinition": "Cách thị trường lao động kết nối người lao động với công việc một cách hiệu quả.",
    "vietnameseExample": "Hiệu quả thị trường lao động đóng góp nhiều hơn vào thành công kinh tế hơn giờ làm việc thô."
  },
  {
    "id": "working-hours-success_topic_2",
    "fileId": "working-hours-success",
    "type": "topic",
    "phrase": "quality of output",
    "englishDefinition": "The standard or value of goods and services produced.",
    "englishExample": "Quality of output often declines when workers are overworked.",
    "vietnameseDefinition": "Tiêu chuẩn hoặc giá trị của hàng hóa và dịch vụ được sản xuất.",
    "vietnameseExample": "Chất lượng sản lượng thường giảm khi người lao động làm việc quá sức."
  },
  {
    "id": "working-hours-success_topic_3",
    "fileId": "working-hours-success",
    "type": "topic",
    "phrase": "diminishing returns",
    "englishDefinition": "The decrease in marginal output as additional input is added.",
    "englishExample": "Beyond a certain point, extra working hours produce diminishing returns.",
    "vietnameseDefinition": "Sự giảm sản lượng cận biên khi đầu vào bổ sung được thêm vào.",
    "vietnameseExample": "Vượt qua một điểm nhất định, giờ làm việc bổ sung tạo ra lợi ích giảm dần."
  },
  {
    "id": "working-hours-success_topic_4",
    "fileId": "working-hours-success",
    "type": "topic",
    "phrase": "technological advancement",
    "englishDefinition": "Progress in technology and innovation.",
    "englishExample": "Technological advancement drives economic growth more effectively than extended work schedules.",
    "vietnameseDefinition": "Tiến bộ trong công nghệ và đổi mới.",
    "vietnameseExample": "Tiến bộ công nghệ thúc đẩy tăng trưởng kinh tế hiệu quả hơn lịch làm việc kéo dài."
  },
  {
    "id": "working-hours-success_topic_5",
    "fileId": "working-hours-success",
    "type": "topic",
    "phrase": "worker wellbeing",
    "englishDefinition": "The physical, mental, and social health of employees.",
    "englishExample": "Worker wellbeing directly impacts productivity and economic performance.",
    "vietnameseDefinition": "Sức khỏe thể chất, tinh thần và xã hội của nhân viên.",
    "vietnameseExample": "Phúc lợi người lao động ảnh hưởng trực tiếp đến năng suất và hiệu suất kinh tế."
  },
  {
    "id": "youth-activities_academic_0",
    "fileId": "youth-activities",
    "type": "academic",
    "word": "recreational facilities",
    "englishDefinition": "Buildings and spaces designed for leisure activities.",
    "englishExample": "Investment in recreational facilities provides youth with healthy outlets.",
    "vietnameseDefinition": "Các tòa nhà và không gian được thiết kế cho các hoạt động giải trí.",
    "vietnameseExample": "Đầu tư vào cơ sở giải trí cung cấp lối thoát lành mạnh cho giới trẻ."
  },
  {
    "id": "youth-activities_academic_1",
    "fileId": "youth-activities",
    "type": "academic",
    "word": "extracurricular activities",
    "englishDefinition": "Activities outside of regular academic curriculum.",
    "englishExample": "Extracurricular activities help develop skills beyond academic learning.",
    "vietnameseDefinition": "Các hoạt động bên ngoài chương trình học thuật thông thường.",
    "vietnameseExample": "Hoạt động ngoại khóa giúp phát triển kỹ năng ngoài học tập học thuật."
  },
  {
    "id": "youth-activities_academic_2",
    "fileId": "youth-activities",
    "type": "academic",
    "word": "youth development",
    "englishDefinition": "Process of helping young people develop their potential.",
    "englishExample": "Youth development programs focus on building character and skills.",
    "vietnameseDefinition": "Quá trình giúp người trẻ phát triển tiềm năng của họ.",
    "vietnameseExample": "Chương trình phát triển thanh thiếu niên tập trung vào xây dựng tính cách và kỹ năng."
  },
  {
    "id": "youth-activities_academic_3",
    "fileId": "youth-activities",
    "type": "academic",
    "word": "public funding",
    "englishDefinition": "Financial support from government resources.",
    "englishExample": "Public funding ensures equal access to recreational opportunities.",
    "vietnameseDefinition": "Hỗ trợ tài chính từ nguồn lực chính phủ.",
    "vietnameseExample": "Tài trợ công đảm bảo quyền tiếp cận bình đẳng các cơ hội giải trí."
  },
  {
    "id": "youth-activities_academic_4",
    "fileId": "youth-activities",
    "type": "academic",
    "word": "delinquency prevention",
    "englishDefinition": "Measures to reduce youth crime and antisocial behavior.",
    "englishExample": "Sports programs serve as effective delinquency prevention strategies.",
    "vietnameseDefinition": "Các biện pháp giảm tội phạm và hành vi chống đối xã hội của giới trẻ.",
    "vietnameseExample": "Chương trình thể thao là chiến lược phòng ngừa phạm pháp hiệu quả."
  },
  {
    "id": "youth-activities_academic_5",
    "fileId": "youth-activities",
    "type": "academic",
    "word": "community centers",
    "englishDefinition": "Public spaces for community activities and services.",
    "englishExample": "Community centers provide safe spaces for youth activities.",
    "vietnameseDefinition": "Không gian công cộng cho các hoạt động và dịch vụ cộng đồng.",
    "vietnameseExample": "Trung tâm cộng đồng cung cấp không gian an toàn cho các hoạt động của giới trẻ."
  },
  {
    "id": "youth-activities_academic_6",
    "fileId": "youth-activities",
    "type": "academic",
    "word": "allocate",
    "englishDefinition": "To distribute resources for a specific purpose.",
    "englishExample": "Governments must allocate budgets wisely across different sectors.",
    "vietnameseDefinition": "Phân phối tài nguyên cho một mục đích cụ thể.",
    "vietnameseExample": "Chính phủ phải phân bổ ngân sách một cách khôn ngoan giữa các lĩnh vực khác nhau."
  },
  {
    "id": "youth-activities_academic_7",
    "fileId": "youth-activities",
    "type": "academic",
    "word": "holistic",
    "englishDefinition": "Considering the whole person, not just one aspect.",
    "englishExample": "Holistic youth development includes physical, mental, and social aspects.",
    "vietnameseDefinition": "Xem xét toàn bộ con người, không chỉ một khía cạnh.",
    "vietnameseExample": "Phát triển toàn diện thanh thiếu niên bao gồm các khía cạnh thể chất, tinh thần và xã hội."
  },
  {
    "id": "youth-activities_topic_0",
    "fileId": "youth-activities",
    "type": "topic",
    "phrase": "sports programs",
    "englishDefinition": "Organized athletic activities and training.",
    "englishExample": "Government-funded sports programs promote physical fitness among youth.",
    "vietnameseDefinition": "Các hoạt động thể thao có tổ chức và đào tạo.",
    "vietnameseExample": "Chương trình thể thao do chính phủ tài trợ thúc đẩy sức khỏe thể chất trong giới trẻ."
  },
  {
    "id": "youth-activities_topic_1",
    "fileId": "youth-activities",
    "type": "topic",
    "phrase": "arts funding",
    "englishDefinition": "Financial support for artistic and cultural activities.",
    "englishExample": "Arts funding enables young people to explore creative talents.",
    "vietnameseDefinition": "Hỗ trợ tài chính cho các hoạt động nghệ thuật và văn hóa.",
    "vietnameseExample": "Tài trợ nghệ thuật cho phép người trẻ khám phá tài năng sáng tạo."
  },
  {
    "id": "youth-activities_topic_2",
    "fileId": "youth-activities",
    "type": "topic",
    "phrase": "youth clubs",
    "englishDefinition": "Organizations providing activities and social opportunities for young people.",
    "englishExample": "Youth clubs offer safe environments for socializing and skill development.",
    "vietnameseDefinition": "Tổ chức cung cấp hoạt động và cơ hội xã hội cho người trẻ.",
    "vietnameseExample": "Câu lạc bộ thanh thiếu niên cung cấp môi trường an toàn để giao lưu và phát triển kỹ năng."
  },
  {
    "id": "youth-activities_topic_3",
    "fileId": "youth-activities",
    "type": "topic",
    "phrase": "after-school programs",
    "englishDefinition": "Supervised activities for students after regular school hours.",
    "englishExample": "After-school programs keep young people engaged in constructive activities.",
    "vietnameseDefinition": "Các hoạt động có giám sát cho học sinh sau giờ học thông thường.",
    "vietnameseExample": "Chương trình sau giờ học giữ cho người trẻ tham gia vào các hoạt động mang tính xây dựng."
  },
  {
    "id": "youth-activities_topic_4",
    "fileId": "youth-activities",
    "type": "topic",
    "phrase": "social cohesion",
    "englishDefinition": "The bonds that bring society together.",
    "englishExample": "Youth activities strengthen social cohesion by bringing diverse groups together.",
    "vietnameseDefinition": "Các mối liên kết gắn kết xã hội với nhau.",
    "vietnameseExample": "Hoạt động thanh thiếu niên tăng cường gắn kết xã hội bằng cách tập hợp các nhóm đa dạng."
  },
  {
    "id": "youth-activities_topic_5",
    "fileId": "youth-activities",
    "type": "topic",
    "phrase": "idle time",
    "englishDefinition": "Unstructured time with nothing to do.",
    "englishExample": "Providing activities reduces idle time that could lead to problematic behavior.",
    "vietnameseDefinition": "Thời gian không có cấu trúc mà không có gì để làm.",
    "vietnameseExample": "Cung cấp hoạt động giảm thời gian nhàn rỗi có thể dẫn đến hành vi có vấn đề."
  }
]