{"id": 1, "title": "A trip to the theatre", "text": "We had a class day out today. We went on a theatre trip _ see Shakespeare's play Hamlet. A friend of mine, _ has always been really into Shakespeare, had already told me the story. Basically, Hamlet discovers a terrible secret about his family, but he can't decide _ to do about it. I won't say any more about the story, in _ you decide to go and see it as well. I'd hate to spoil it _ you! The only thing I didn't like about the play was _ fact that it lasted four hours. For me, that was far _ long, and the seats were quite uncomfortable. Afterwards, my mum asked me _ I'd go and see another Shakespeare play. I said yes, probably, but I'd take a cushion next time!", "gaps": [{"item": 1, "answers": ["to"], "explanation": "Dùng 'to' để chỉ mục đích (in order to) - đi xem kịch để xem vở Hamlet"}, {"item": 2, "answers": ["who"], "explanation": "Dùng 'who' làm đại từ quan hệ chỉ người (a friend)"}, {"item": 3, "answers": ["what"], "explanation": "Dùng 'what' để hỏi cái gì cần làm (what to do)"}, {"item": 4, "answers": ["case"], "explanation": "Cụm 'in case' nghĩa là 'phòng khi' hoặc 'trong trường hợp'"}, {"item": 5, "answers": ["for"], "explanation": "Dùng 'for' sau 'spoil' để chỉ đối tượng bị ảnh hưởng"}, {"item": 6, "answers": ["the"], "explanation": "Dùng 'the' trước 'fact' theo cấu trúc 'the fact that...'"}, {"item": 7, "answers": ["too"], "explanation": "Dùng 'too' để chỉ quá mức (far too long = quá dài)"}, {"item": 8, "answers": ["if", "whether"], "explanation": "Dùng 'if' hoặc 'whether' trong câu hỏi gián tiếp"}]}
{"id": 2, "title": "School Jazz Band", "text": "Do you play a jazz instrument – maybe the trumpet, guitar or drums? Do you want to have some musical fun with other students in the school _ have similar interests to yours? If you do, come and join us on Tuesdays after school in the music room. At the moment, there are eight of us playing quite a wide range of instruments. We're having such _ great time and Mr Jones is an amazing jazz teacher, but we need more people, especially electric guitarists!\n\nWe're hoping _ perform in the end-of-term show and Mr Jones said he'll deal _ all the technical arrangements and the sound system, which is great! \n\nEither come and ask me _ more details during one of the lunch breaks, _ just turn up on the day. But don't forget to bring your instrument! See you there!\n\nSam (from the School Jazz Band)", "gaps": [{"item": 1, "answers": ["who", "that"], "explanation": "Dùng 'who' hoặc 'that' làm đại từ quan hệ chỉ 'students'"}, {"item": 2, "answers": ["a"], "explanation": "Cụm 'such a great time' - 'a' đứng sau 'such' trước danh từ đếm được số ít"}, {"item": 3, "answers": ["to"], "explanation": "Dùng 'to' sau 'hope' để diễn đạt hy vọng làm gì (hope to do)"}, {"item": 4, "answers": ["with"], "explanation": "Cụm động từ 'deal with' nghĩa là xử lý, giải quyết"}, {"item": 5, "answers": ["for"], "explanation": "Dùng 'for' sau 'ask' để hỏi về thông tin gì (ask for details)"}, {"item": 6, "answers": ["or"], "explanation": "Dùng 'or' để nối hai lựa chọn (either...or)"}]}
{"id": 3, "title": "A wildlife boat tour", "text": "When I was on holiday with my parents, we went on a wildlife tour. The trip involved sailing round some islands off the coast, not too far _ our hotel. Some other guests had been on the tour, and recommended it to my parents, who immediately decided we should go.\n\nIn the morning our guide, Jake, picked us _ in his boat and off we went. Jake knew lots about the wildlife on the islands and we saw everything we were hoping to, apart from one bird, called a harrier, which didn't appear. But that didn't matter _ we saw many other amazing birds.\n\nMy parents especially liked the fact that _ were very few people on the tour. Jake had time to answer all our questions, so we felt we learnt _ than we'd expected. And we agreed this wildlife experience was _ of the best we'd ever had.", "gaps": [{"item": 1, "answers": ["from"], "explanation": "Dùng 'far from' để chỉ khoảng cách xa (not too far from = không quá xa)"}, {"item": 2, "answers": ["up"], "explanation": "Cụm động từ 'pick up' nghĩa là đón ai đó"}, {"item": 3, "answers": ["because", "as", "since"], "explanation": "Dùng 'because/as/since' để chỉ lý do (bởi vì)"}, {"item": 4, "answers": ["there"], "explanation": "Cấu trúc 'there + be' để chỉ sự tồn tại (có/không có)"}, {"item": 5, "answers": ["more"], "explanation": "Dùng 'more' trong so sánh hơn (learnt more than = học được nhiều hơn)"}, {"item": 6, "answers": ["one"], "explanation": "Dùng 'one of the best' để chỉ một trong những...tốt nhất"}]}
{"id": 4, "title": "My city", "text": "by Harry Salter\n\nDo you live in a nice place? I do! The city _ I live is called Bristol, and it's in the south west of England. It's not very big, but there are loads of things for teenagers to do here.\n\n_ you're interested in television, you should go to the Bristol TV and Radio Studios. On the tour of the studios, you can have a go at presenting and appear _ your own radio drama.\n\nOr if you're into sport, why _ try canoeing? The best place is a very pretty local section of the Kennet and Avon canal. It connects Bristol to London and it _ built in the early 18th century, so you can experience some local history at the same time.\n\nThese are just two _ the many things you can do here. It really is a great place.", "gaps": [{"item": 1, "answers": ["where"], "explanation": "Dùng 'where' làm trạng từ quan hệ chỉ nơi chốn (the city where I live)"}, {"item": 2, "answers": ["If"], "explanation": "Dùng 'If' để bắt đầu câu điều kiện (nếu bạn thích...)"}, {"item": 3, "answers": ["in"], "explanation": "Dùng 'appear in' để chỉ xuất hiện trong chương trình/vở kịch"}, {"item": 4, "answers": ["not"], "explanation": "Cấu trúc 'Why not + V' để đưa ra gợi ý (tại sao không thử...)"}, {"item": 5, "answers": ["was"], "explanation": "Dùng thì quá khứ đơn bị động 'was built' (được xây dựng)"}, {"item": 6, "answers": ["of"], "explanation": "Cụm 'two of the many things' - dùng 'of' để chỉ một phần của tổng thể"}]}
{"id": 5, "title": "Review of Amazing", "text": "By Gina Thomann\n\nA new play called Amazing is now on at the Town Theatre, and it's really worth seeing. The action takes _ in a school, and the play starts by showing a group of students at the school inventing an extraordinary machine. They then use this machine to travel backwards through time in order _ learn about history and other school subjects. _ example, they see exactly what happened when important medicines _ discovered.\n\n_ the story is extremely interesting, some of the acting is not so good. None _ the actors are very well-known, and I think the play would be a bit better _ it had more experienced people in the main roles.\n\nDespite _ , I would definitely recommend you to go and see it because of the fantastic story, and the rather surprising ending.", "gaps": [{"item": 1, "answers": ["place"], "explanation": "Cụm 'take place' nghĩa là diễn ra, xảy ra"}, {"item": 2, "answers": ["to"], "explanation": "Cụm 'in order to' để chỉ mục đích (để mà)"}, {"item": 3, "answers": ["For"], "explanation": "Cụm 'for example' nghĩa là ví dụ như"}, {"item": 4, "answers": ["were"], "explanation": "Dùng bị động quá khứ 'were discovered' (được phát hiện ra)"}, {"item": 5, "answers": ["Although", "Though", "While"], "explanation": "Dùng 'Although/Though/While' để chỉ sự nhượng bộ (mặc dù)"}, {"item": 6, "answers": ["of"], "explanation": "Cụm 'none of' nghĩa là không ai trong số"}, {"item": 7, "answers": ["if"], "explanation": "Câu điều kiện loại 2 với 'if' (giả định không có thật)"}, {"item": 8, "answers": ["this", "that", "everything"], "explanation": "Dùng 'this/that/everything' để chỉ những điều đã đề cập trước đó"}]}
{"id": 6, "title": "Match report: National Schools Tournament", "text": "By William Jacobs, football captain\n\nLast Saturday, our school football team took part in the National Schools Tournament. It was a long day – we got to school very early as the bus _ would take us to the tournament had to leave by 7 a.m. _ an hour's drive we arrived at the City Stadium, where the competition was taking _ . Playing in such _ famous stadium was an experience we will never forget. \n\nWe played against some _ the top teams from around the country, and we came first! This was amazing, because the other teams were much stronger this year _ they were last year. \n\nWe were given our prize, a beautiful silver cup, and then we went on a tour around the stadium. We all agreed that it _ been an incredible day, and we hope to _ able to return next year!", "gaps": [{"item": 1, "answers": ["which", "that"], "explanation": "Đại từ quan hệ 'which/that' chỉ vật (the bus)"}, {"item": 2, "answers": ["After"], "explanation": "Dùng 'After' để chỉ thời gian sau khi điều gì đó xảy ra"}, {"item": 3, "answers": ["place"], "explanation": "Cụm 'taking place' nghĩa là đang diễn ra"}, {"item": 4, "answers": ["a"], "explanation": "Dùng 'such a + tính từ + danh từ' để nhấn mạnh"}, {"item": 5, "answers": ["of"], "explanation": "Cụm 'some of the' nghĩa là một số trong những..."}, {"item": 6, "answers": ["than"], "explanation": "Dùng 'than' trong câu so sánh hơn (stronger...than)"}, {"item": 7, "answers": ["had"], "explanation": "Dùng thì quá khứ hoàn thành 'had been' với câu gián tiếp"}, {"item": 8, "answers": ["be"], "explanation": "Cấu trúc 'hope to be able to' (hy vọng có thể)"}]}
{"id": 7, "title": "Book review", "text": "I've just finished reading Sara Tyler's latest book, Gold River. I think that it's even better _ her last book. If you're looking _ an interesting book to read, then this _ the perfect choice.\n\nThe main characters are described in a lot of detail, and I really cared about _ happened to them. If you're one of the thousands of people who have enjoyed other books _ Sara Tyler, you'll already know that some of her novels were made into films _ few years ago. I wouldn't be surprised if this happens to Gold River too. Although this book has new characters, _ is set in the same place _ her other stories, so you might recognise some of the locations. Go and read it – I promise you won't regret it!", "gaps": [{"item": 1, "answers": ["than"], "explanation": "Dùng 'than' trong câu so sánh hơn (better than = tốt hơn)"}, {"item": 2, "answers": ["for"], "explanation": "Cụm 'look for' nghĩa là tìm kiếm"}, {"item": 3, "answers": ["is"], "explanation": "Dùng 'is' với chủ ngữ 'this' ở thì hiện tại đơn"}, {"item": 4, "answers": ["what"], "explanation": "Dùng 'what' để chỉ điều gì xảy ra (what happened)"}, {"item": 5, "answers": ["by"], "explanation": "Dùng 'by' để chỉ tác giả của cuốn sách (books by Sara Tyler)"}, {"item": 6, "answers": ["a"], "explanation": "Cụm 'a few years ago' nghĩa là vài năm trước"}, {"item": 7, "answers": ["it"], "explanation": "Dùng 'it' để thay thế cho 'this book' (cuốn sách này)"}, {"item": 8, "answers": ["as"], "explanation": "Cụm 'the same...as' để chỉ giống nhau (cùng địa điểm như)"}]}
{"id": 8, "title": "Science fiction film", "text": "Hi Sam,\n\nHave you seen the new science fiction film Rocket? I was really interested in seeing it because it was based _ the book called Spacemen, which is _ of my favourite novels. To be honest, I always find _ difficult when something that I've read and enjoyed is turned into a film, because it's never exactly the same _ I imagined! But _ time I really wasn't disappointed – the acting was great, and the main characters were very similar to how the author described them in the novel.\n\n_ you haven't seen it yet, why don't you come round to my house and watch it online _ me? I know you love science fiction, so it would be great to hear _ you think of the film!\n\nI'm looking forward to seeing you then! \n\nCarys", "gaps": [{"item": 1, "answers": ["on"], "explanation": "Cụm 'be based on' nghĩa là dựa trên"}, {"item": 2, "answers": ["one"], "explanation": "Dùng 'one of' để chỉ một trong những..."}, {"item": 3, "answers": ["it"], "explanation": "Cấu trúc 'find it + tính từ' với 'it' là chủ ngữ giả"}, {"item": 4, "answers": ["as"], "explanation": "Cụm 'the same as' để so sánh giống như"}, {"item": 5, "answers": ["this"], "explanation": "Dùng 'this time' để chỉ lần này (khác với các lần trước)"}, {"item": 6, "answers": ["If"], "explanation": "Dùng 'If' để bắt đầu câu điều kiện (nếu bạn chưa xem)"}, {"item": 7, "answers": ["with"], "explanation": "Dùng 'with' để chỉ cùng với ai đó"}, {"item": 8, "answers": ["what"], "explanation": "Dùng 'what' trong cụm 'what you think' (ý kiến của bạn)"}]}
{"id": 9, "title": "My hobby", "text": "By Jenny Winter\n\nI love playing the guitar. I started playing a _ weeks ago, and my teacher is really good. Even though I _ only had six lessons so far, I can already play some tunes! I was quite surprised really, because I also play the violin, which is much harder.\n\nI have an electric guitar. _ best thing about playing this instrument is being able to use headphones when I practise, which I do for _ least thirty minutes every day. Wearing the headphones means that _ is really easy to concentrate.\n\nMy teacher asked me _ enter a competition for new players next month, so I _ working hard for that right now. I'd be really happy _ I won!", "gaps": [{"item": 1, "answers": ["few"], "explanation": "Cụm 'a few weeks ago' nghĩa là vài tuần trước"}, {"item": 2, "answers": ["have", "'ve"], "explanation": "Dùng thì hiện tại hoàn thành 'have had' với 'so far'"}, {"item": 3, "answers": ["The"], "explanation": "Dùng 'The' trước so sánh nhất 'best thing'"}, {"item": 4, "answers": ["at"], "explanation": "Cụm 'at least' nghĩa là ít nhất"}, {"item": 5, "answers": ["it"], "explanation": "Cấu trúc 'it is + tính từ' với 'it' là chủ ngữ giả"}, {"item": 6, "answers": ["to"], "explanation": "Cấu trúc 'ask + người + to V' (yêu cầu ai làm gì)"}, {"item": 7, "answers": ["am", "'m"], "explanation": "Dùng thì hiện tại tiếp diễn 'am working' với 'right now'"}, {"item": 8, "answers": ["if"], "explanation": "Dùng 'if' trong câu điều kiện loại 2 (giả định)"}]}
{"id": 10, "title": "Learning to ski", "text": "I'll always remember skiing for the first time. Until I went on a trip to Queenstown, New Zealand, I _ never seen snow!\n\nOn the first day, I signed _ for a skiing lesson for complete beginners. During the lesson I only learnt some basic techniques, but I still thought I was good enough to go skiing all by _ !\n\nLuckily, I managed _ reach the peak without falling off the ski lift. Then I had to ski down the mountain, even _ I didn't know how to stop or turn very well. As _ as I pointed my skis towards the track I began gaining speed. _ few minutes later, I started shouting at skiers to move out of my way! \n\nNot surprisingly, I crashed into a tree. I didn't get hurt, but I lost my sunglasses. I didn't go near skis for a very long time _ that!", "gaps": [{"item": 1, "answers": ["had", "'d"], "explanation": "Dùng thì quá khứ hoàn thành 'had never seen' (chưa từng thấy)"}, {"item": 2, "answers": ["up"], "explanation": "Cụm động từ 'sign up' nghĩa là đăng ký"}, {"item": 3, "answers": ["myself"], "explanation": "Cụm 'by myself' nghĩa là tự mình, một mình"}, {"item": 4, "answers": ["to"], "explanation": "Cấu trúc 'manage to V' nghĩa là xoay sở để làm gì"}, {"item": 5, "answers": ["though"], "explanation": "Dùng 'even though' để chỉ mặc dù (nhượng bộ mạnh)"}, {"item": 6, "answers": ["soon"], "explanation": "Cụm 'as soon as' nghĩa là ngay khi"}, {"item": 7, "answers": ["A"], "explanation": "Cụm 'A few minutes later' nghĩa là vài phút sau đó"}, {"item": 8, "answers": ["after"], "explanation": "Dùng 'after that' để chỉ sau sự việc đó"}]}
{"id": 11, "title": "Moving house", "text": "Hi Alex,\n\nHow are you? This week's been a very busy one for me – I finally moved house! _ wasn't until I started to pack a few days ago that I realised how much stuff I had. I really think moving house is one of the _ stressful things I've ever done! I was sad to leave my old house – after _ , I'd lived there my whole life so I have lots of good memories. \n\nAnyway, I'm looking _ to being in this new house. It's not as big as the old one, but _ least it's got a great garden. I'm planning to have a small party on Saturday night. Are you free then? Why don't you come along _ you are? I hope you can make it. Let me know.\n\nAll the best,\n\nSam", "gaps": [{"item": 1, "answers": ["It"], "explanation": "Cấu trúc 'It wasn't until...that' để nhấn mạnh thời điểm"}, {"item": 2, "answers": ["most"], "explanation": "Dùng 'most' để tạo so sánh nhất (most stressful = căng thẳng nhất)"}, {"item": 3, "answers": ["all"], "explanation": "Cụm 'after all' nghĩa là xét cho cùng, suy cho cùng"}, {"item": 4, "answers": ["forward"], "explanation": "Cụm động từ 'look forward to' nghĩa là mong đợi"}, {"item": 5, "answers": ["at"], "explanation": "Cụm 'at least' nghĩa là ít nhất"}, {"item": 6, "answers": ["if"], "explanation": "Dùng 'if' trong câu điều kiện (nếu bạn rảnh)"}]}
{"id": 12, "title": "The Westway Cinema", "text": "The new Westway Cinema is finally open! I went last night with my brother, and we both agreed it's much better than the old one _ to be. Although the ticket prices are higher, the extra cost is worth paying.\n\nThe new owners _ now taken out all the old seats and put in brand new ones that are really comfortable. There's also new air conditioning. This is fantastic because in the past it was sometimes _ hot that it was difficult to concentrate on the film!\n\nThere are also special offers available. For example, _ you buy two tickets, you can choose something for free – either a snack or a drink. I'm sure this _ be popular, as you can't bring _ own food into the cinema. \n\nI'd really recommend going to the Westway Cinema – it's a great night out.", "gaps": [{"item": 1, "answers": ["used"], "explanation": "Cụm 'used to be' nghĩa là từng là (trong quá khứ)"}, {"item": 2, "answers": ["have"], "explanation": "Dùng thì hiện tại hoàn thành 'have taken' với 'now'"}, {"item": 3, "answers": ["so"], "explanation": "Cấu trúc 'so...that' để chỉ quá...đến nỗi"}, {"item": 4, "answers": ["if", "when", "whenever", "provided"], "explanation": "Dùng 'if/when/whenever/provided' trong câu điều kiện"}, {"item": 5, "answers": ["will"], "explanation": "Dùng 'will' để dự đoán tương lai"}, {"item": 6, "answers": ["your"], "explanation": "Dùng 'your own' để chỉ đồ ăn của chính bạn"}]}
{"id": 13, "title": "", "text": "From: Harry \n\nTo: Oliver\n\nSubject: Piano lessons \n\nHi Oliver,\n\nGuess what? I've finally started piano lessons, like you! As you know, it's something I've wanted to do ever _ I was young. Anyway, a couple of months ago I saw someone playing the piano on TV – he was brilliant. And when I found out he'd only started playing quite recently, that encouraged _ to start lessons. \n\nI've got a really good teacher, and I go to her house _ lessons twice a week. She's very patient. _ time I make a mistake, she explains what I did wrong. Also, I couldn't read music when I started, so it's been hard to learn to read the notes on the page at the _ time as deciding which piano keys to use! But _ I finally play something that other people recognise, it really makes me happy. Maybe _  day, I'll become an even better piano player _ you!", "gaps": [{"item": 1, "answers": ["since"], "explanation": "Dùng 'ever since' để chỉ từ khi (thời điểm trong quá khứ)"}, {"item": 2, "answers": ["me"], "explanation": "Dùng 'me' làm tân ngữ của động từ 'encouraged'"}, {"item": 3, "answers": ["for"], "explanation": "Dùng 'for' để chỉ mục đích (đến nhà để học)"}, {"item": 4, "answers": ["Every", "Each"], "explanation": "Dùng 'Every/Each time' nghĩa là mỗi lần, mỗi khi"}, {"item": 5, "answers": ["same"], "explanation": "Cụm 'at the same time as' nghĩa là cùng lúc với"}, {"item": 6, "answers": ["when", "whenever", "if"], "explanation": "Dùng 'when/whenever/if' để chỉ thời điểm hoặc điều kiện"}, {"item": 7, "answers": ["one", "some"], "explanation": "Cụm 'one day/some day' nghĩa là một ngày nào đó"}, {"item": 8, "answers": ["than"], "explanation": "Dùng 'than' trong so sánh hơn (better...than)"}]}
{"id": 14, "title": "My travel blog", "text": "This summer, I travelled to Copenhagen, the capital of Denmark, on my own. I am only 20 and to _ honest, I was nervous about exploring a new city alone. I decided to go on a free walking tour the first day I was there. I hoped the tour would help me to become more familiar _ the city. \n\nUnfortunately, the weather wasn't great, but the tour was still absolutely fantastic! Magnus, our tour guide, knew all about the city's history. We also learnt loads _ interesting facts about Danish culture. At the end of the tour, he gave _ all suggestions for the best places _ eat and visit.\n\nApart from learning so much, I actually had a lot more fun on the walking tour _ I'd expected. It was an excellent way to experience the city, and learn about its culture and history.", "gaps": [{"item": 1, "answers": ["be"], "explanation": "Cụm 'to be honest' nghĩa là thành thật mà nói"}, {"item": 2, "answers": ["with"], "explanation": "Cụm 'familiar with' nghĩa là quen thuộc với"}, {"item": 3, "answers": ["of"], "explanation": "Cụm 'loads of' nghĩa là rất nhiều"}, {"item": 4, "answers": ["us"], "explanation": "Dùng 'us' làm tân ngữ của 'gave' (cho chúng tôi)"}, {"item": 5, "answers": ["to"], "explanation": "Cấu trúc 'places to eat' với 'to' chỉ mục đích"}, {"item": 6, "answers": ["than"], "explanation": "Dùng 'than' trong so sánh hơn (more fun...than)"}]}
{"id": 15, "title": "Starting at college", "text": "Hi, my name's Emma. Welcome to the college! I've been studying here for a year now. Starting at college isn't easy, but I'm sure you'll soon feel at home. When I first started studying here last year, I was _ nervous that I couldn't even ask anyone for help. I got lost five times on my first day!\n\nRemember that _ student at the college has been new at one time, and understands how you feel. So _ you're not sure where to go, just ask – we're all happy to help!\n\nYou probably don't know many people here. To make some friends, _ not spend break times with some of your new classmates in the café? Or how _ joining one of the many clubs we have at the college? _ are lots to choose from.\n\nGood luck on your new course!", "gaps": [{"item": 1, "answers": ["so"], "explanation": "Cấu trúc 'so...that' để chỉ quá...đến nỗi"}, {"item": 2, "answers": ["every", "each"], "explanation": "Dùng 'every/each student' nghĩa là mỗi sinh viên"}, {"item": 3, "answers": ["if", "when", "whenever"], "explanation": "Dùng 'if/when/whenever' trong câu điều kiện"}, {"item": 4, "answers": ["why"], "explanation": "Cấu trúc 'why not' để đưa ra gợi ý"}, {"item": 5, "answers": ["about"], "explanation": "Cụm 'how about' để đề xuất ý kiến"}, {"item": 6, "answers": ["There"], "explanation": "Cấu trúc 'There are' để chỉ sự tồn tại"}]}
{"id": 16, "title": "Letter to a restaurant", "text": "Dear Mrs Cutter,\n\nI am writing to complain about a recent visit I made to your restaurant. I went there last Tuesday with my parents, _ were celebrating their wedding anniversary. We have _ to your restaurant many times before and always enjoyed it. _ time, however, there was a problem with the service. \n\nYour restaurant was not very busy on Tuesday evening. In spite _ that, it took a long time for anyone to come and take our order. We then had to wait for at _ an hour before the food arrived. As we _ already arranged to meet some family friends after our meal, we were late meeting them in _ end because of the slow service at your restaurant.\n\nI suggest that you discuss the issue _ your staff to prevent it happening again.\n\nYours sincerely,\n\nPeter Hamilton", "gaps": [{"item": 1, "answers": ["who"], "explanation": "Dùng 'who' làm đại từ quan hệ chỉ người (my parents)"}, {"item": 2, "answers": ["been"], "explanation": "Dùng thì hiện tại hoàn thành 'have been' với 'many times before'"}, {"item": 3, "answers": ["This"], "explanation": "Dùng 'This time' để chỉ lần này (khác với các lần trước)"}, {"item": 4, "answers": ["of"], "explanation": "Cụm 'in spite of' nghĩa là mặc dù, bất chấp"}, {"item": 5, "answers": ["least"], "explanation": "Cụm 'at least' nghĩa là ít nhất"}, {"item": 6, "answers": ["had"], "explanation": "Dùng thì quá khứ hoàn thành 'had arranged' (đã sắp xếp trước đó)"}, {"item": 7, "answers": ["the"], "explanation": "Cụm 'in the end' nghĩa là cuối cùng, rốt cuộc"}, {"item": 8, "answers": ["with"], "explanation": "Cụm động từ 'discuss with' nghĩa là thảo luận với ai"}]}
{"id": 17, "title": "Becoming more active", "text": "Last year, I decided that I wasn't active enough. I was spending too long sitting in _ of a screen every day and I wasn't getting as _ exercise as I needed. So I decided that I would feel a lot better _ I actually started doing some kind _ sport. But to be honest, I'm not really into team games. _ I needed was an outdoor hobby that I could do on my own. Then a friend said I should have a go at mountain-biking, and _ first time I tried it, I absolutely loved it. There's a beautiful forest about 5 kilometres _ my home which is really popular with mountain-bikers. These days, I usually go there twice _ week. Mountain-biking is a great way to stay fit, and it's great fun, too!", "gaps": [{"item": 1, "answers": ["front"], "explanation": "Cụm 'in front of' nghĩa là ở phía trước"}, {"item": 2, "answers": ["much"], "explanation": "Dùng 'as much as' trong so sánh bằng với danh từ không đếm được"}, {"item": 3, "answers": ["if", "when"], "explanation": "Dùng 'if/when' trong câu điều kiện"}, {"item": 4, "answers": ["of"], "explanation": "Cụm 'some kind of' nghĩa là một loại nào đó"}, {"item": 5, "answers": ["What", "All"], "explanation": "Dùng 'What/All' để chỉ điều cần thiết (What I needed = điều tôi cần)"}, {"item": 6, "answers": ["the"], "explanation": "Cụm 'the first time' để chỉ lần đầu tiên"}, {"item": 7, "answers": ["from"], "explanation": "Dùng 'from' để chỉ khoảng cách tính từ đâu"}, {"item": 8, "answers": ["a"], "explanation": "Cụm 'twice a week' nghĩa là hai lần một tuần"}]}
{"id": 18, "title": "College careers fair", "text": "Last week, I went with forty students on my college course to attend a careers fair in the capital city. During the coach journey most of _ either slept or listened to music, and four hours later we arrived _ the careers fair. _ the early departure and long journey it was definitely worth going, as we all found the fair really exciting and interesting. _ were around sixty education and job stalls, and so much careers information available. I am keen _ learning as much as possible about business and hope to open _ own health food company one day, so I also went to a short talk about how _ start up a business. I returned to college with several brochures _ are full of facts and helpful advice. If any students are thinking of going to next year's fair, I would definitely recommend it!", "gaps": [{"item": 1, "answers": ["us", "them"], "explanation": "Dùng 'us/them' để chỉ phần lớn trong nhóm sinh viên"}, {"item": 2, "answers": ["at"], "explanation": "Dùng 'arrive at' với địa điểm cụ thể"}, {"item": 3, "answers": ["Despite"], "explanation": "Dùng 'Despite' để chỉ mặc dù (+ danh từ/cụm danh từ)"}, {"item": 4, "answers": ["There"], "explanation": "Cấu trúc 'There were' để chỉ sự tồn tại"}, {"item": 5, "answers": ["on"], "explanation": "Cụm 'keen on' nghĩa là quan tâm đến, say mê"}, {"item": 6, "answers": ["my"], "explanation": "Dùng 'my own' để chỉ công ty của chính mình"}, {"item": 7, "answers": ["to"], "explanation": "Cấu trúc 'how to V' (cách làm gì)"}, {"item": 8, "answers": ["which", "that"], "explanation": "Đại từ quan hệ 'which/that' chỉ vật (brochures)"}]}
{"id": 19, "title": "Spanish conversation club", "text": "We're a group of people aged 16-25 who meet every week for two hours of chat in Spanish. You don't have to be able to speak much Spanish: we welcome beginners, too. We talk about anything _ may interest people, from food people enjoy _ literature and politics. \n\nWe meet between 4.30 _ 6.30 p.m. every Tuesday, in a large, comfortable room in the Central Library. The sessions are free, but we do ask people to pay £1 a session for coffee or juice. Staff from the School of Tourism at the University set _ the group three years ago, but it's now organised _ volunteers. The number of members _ grown a lot during this time. As well as allowing people to practise their Spanish, the club brings people from different backgrounds together in order to enjoy each other's company.", "gaps": [{"item": 1, "answers": ["which", "that"], "explanation": "Đại từ quan hệ 'which/that' chỉ vật (anything)"}, {"item": 2, "answers": ["to"], "explanation": "Cụm 'from...to' để chỉ phạm vi từ...đến"}, {"item": 3, "answers": ["and"], "explanation": "Cụm 'between...and' để chỉ khoảng thời gian giữa hai mốc"}, {"item": 4, "answers": ["up"], "explanation": "Cụm động từ 'set up' nghĩa là thành lập"}, {"item": 5, "answers": ["by"], "explanation": "Dùng 'by' trong câu bị động để chỉ tác nhân"}, {"item": 6, "answers": ["has"], "explanation": "Dùng thì hiện tại hoàn thành 'has grown' với chủ ngữ số ít"}]}
{"id": 20, "title": "A rainy day", "text": "One summer's day, my family decided to visit a waterfall in the countryside near our town. As we walked across the fields towards the waterfall, we _ see it in the distance. It was quite _ long way, but we got there after about an hour. We sat down near the pool at the bottom of the waterfall to enjoy the picnic that we _ taken with us. Then we noticed some black clouds in the sky, and some large drops _ rain fell on us, so we quickly started to collect our things together. Soon the rain began _ fall heavily. Carrying our bags, we ran as fast as we could, and when we reached the town, we went into the first café we saw. In _ of our wet clothes, we soon felt better after a delicious drink of hot chocolate!", "gaps": [{"item": 1, "answers": ["could"], "explanation": "Dùng 'could' để chỉ khả năng trong quá khứ (có thể thấy)"}, {"item": 2, "answers": ["a"], "explanation": "Cụm 'quite a long way' nghĩa là khá xa"}, {"item": 3, "answers": ["had", "'d"], "explanation": "Dùng thì quá khứ hoàn thành 'had taken' (đã mang theo)"}, {"item": 4, "answers": ["of"], "explanation": "Cụm 'drops of rain' nghĩa là những giọt mưa"}, {"item": 5, "answers": ["to"], "explanation": "Cấu trúc 'begin to V' nghĩa là bắt đầu làm gì"}, {"item": 6, "answers": ["spite"], "explanation": "Cụm 'in spite of' nghĩa là mặc dù, bất chấp"}]}
{"id": 21, "title": "How to hold a fun party", "text": "Are you thinking about holding a party? Then you need _ make sure it's lots of fun! Invite plenty _ people and include a few surprises. For example, if you're serving food, try ordering ten pizzas _ are the same flavour but come from different restaurants in your area. Then have a 'taste test' and vote on _ best one. Or _ about playing games? You could have a video games tournament and offer prizes for the winners. You could also have a singing competition and ask _ guest to sing a song.\n\nIf your party includes a meal around a table, for each new course, ask your guests to sit next to someone different, in _ to talk to as many different people _ possible. Finally, play fun music: your guests might even get up and dance!", "gaps": [{"item": 1, "answers": ["to"], "explanation": "Cấu trúc 'need to V' nghĩa là cần phải làm gì"}, {"item": 2, "answers": ["of"], "explanation": "Cụm 'plenty of' nghĩa là nhiều"}, {"item": 3, "answers": ["that", "which"], "explanation": "Đại từ quan hệ 'that/which' chỉ vật (pizzas)"}, {"item": 4, "answers": ["the"], "explanation": "Dùng 'the best' trong so sánh nhất"}, {"item": 5, "answers": ["how", "what"], "explanation": "Cụm 'how/what about' để đưa ra đề xuất"}, {"item": 6, "answers": ["every", "each"], "explanation": "Dùng 'every/each guest' nghĩa là mỗi khách"}, {"item": 7, "answers": ["order"], "explanation": "Cụm 'in order to' để chỉ mục đích"}, {"item": 8, "answers": ["as"], "explanation": "Cụm 'as...as possible' nghĩa là càng...càng tốt"}]}
