[
  {
    "id": 1,
    "topic": "Describe a time when you helped someone",
    "filename": "01-Describe-a-time-when-you-helped-someone.mp3",
    "text": "I'd like to talk about a time last year when I helped my elderly neighbor, Mrs. Chen, who lives alone in the apartment next to mine. One evening, I heard her calling for help, and when I checked on her, I discovered she had fallen and injured her ankle. I immediately called an ambulance and stayed with her until the paramedics arrived, trying to keep her calm and comfortable. After she was treated at the hospital, I visited her daily for about two weeks, helping her with grocery shopping, cooking meals, and doing household chores that she couldn't manage with her injured ankle. I helped her because I felt it was the right thing to do - she had no family nearby, and I couldn't imagine leaving her to struggle alone. Throughout this experience, I felt a deep sense of fulfillment and purpose. It reminded me how small acts of kindness can make a significant difference in someone's life, and it actually brought us closer together as neighbors. Even now, we have regular tea together and look out for each other.",
    "word_count": 181,
    "file_size_kb": 345.66
  },
  {
    "id": 2,
    "topic": "Describe an important decision you made",
    "filename": "02-Describe-an-important-decision-you-made.mp3",
    "text": "The most important decision I've made was choosing to change my university major from engineering to business administration during my second year of studies. I was struggling with engineering courses and felt increasingly unhappy, even though my family had high expectations for me to become an engineer. The decision-making process was quite difficult and took me about three months. I started by honestly assessing my strengths and interests, and I realized I was much more passionate about subjects like marketing and management. I also spoke with my academic advisor, attended business school seminars, and even talked to graduates from both fields to understand the career prospects. The hardest part was having a frank conversation with my parents about changing my path. The impact of this decision has been tremendously positive. My grades improved dramatically because I was genuinely interested in what I was learning, and I became much happier overall. I also discovered talents I didn't know I had, particularly in public speaking and project management. Looking back, this taught me that success comes from following your genuine interests rather than meeting others' expectations. It was a pivotal moment that shaped my entire career direction.",
    "word_count": 195,
    "file_size_kb": 440.58
  },
  {
    "id": 3,
    "topic": "Describe a time when you were very busy",
    "filename": "03-Describe-a-time-when-you-were-very-busy.mp3",
    "text": "The person who has influenced me most profoundly is my high school literature teacher, Mr. Thompson, who taught me during my final two years of school. He was quite different from other teachers - in his mid-forties, always wearing colorful bow ties, with an infectious enthusiasm that made even the most reluctant students engage with literature. What made him exceptional was his teaching philosophy: he never just taught us what books meant, but rather encouraged us to think critically and form our own interpretations. I met him when I was 16, during a particularly difficult period when I was struggling with self-confidence and direction in life. Mr. Thompson's classes were held in a classroom filled with books, comfortable chairs, and inspirational quotes on the walls, creating an atmosphere more like a cozy library than a traditional classroom. He would often stay after school to discuss books with students who were interested, and I became one of his regular visitors. His influence on me has been transformative. He introduced me to authors and ideas that shaped my worldview, teaching me that literature isn't just entertainment but a tool for understanding human nature and society. More importantly, he believed in my potential when I didn't believe in myself, encouraging me to write and think creatively. I feel deeply grateful whenever I think about his impact on my life. His passion for teaching and genuine care for his students' growth showed me the kind of person I wanted to become - someone who inspires and empowers others. The way he listened to students, really listened, without judgment, taught me the value of empathy and understanding. Even now, years later, when I face difficult decisions or challenges, I often think \"What would Mr. Thompson advise?\" His influence extends beyond academics; he fundamentally changed how I approach life and interact with others.",
    "word_count": 307,
    "file_size_kb": 657.7
  },
  {
    "id": 4,
    "topic": "Describe a family member you admire",
    "filename": "04-Describe-a-family-member-you-admire.mp3",
    "text": "I'd like to talk about my best friend Sarah, whom I've known for over 15 years now. We first met in middle school when we were both 12 years old - we were assigned to sit next to each other in English class, and we immediately clicked. In those early years, we were inseparable at school, spending every break together, studying for exams as a team, and sharing all our teenage dramas and dreams. We both loved reading and would exchange books constantly, discussing characters and plots for hours. Currently, even though we live in different cities due to our careers, we remain incredibly close. We video chat at least twice a week, usually on weekend evenings, catching up on everything happening in our lives. Whenever we visit each other, which is typically every two or three months, we fall right back into our old rhythm - we cook together, go for long walks while talking non-stop, and binge-watch our favorite series. We also maintain a tradition of taking an annual trip together, just the two of us, which has become sacred time we both protect in our calendars. I believe our friendship will continue to grow stronger in the future. We've already talked about how we want our children to grow up knowing each other, and we dream about eventually living in the same city again when we retire. This friendship has endured because we share fundamental values and have always been completely honest with each other, even when the truth is uncomfortable. We've supported each other through difficult times - breakups, family problems, career setbacks - and celebrated all the good moments together, which has created an unbreakable bond.",
    "word_count": 281,
    "file_size_kb": 567.28
  },
  {
    "id": 5,
    "topic": "Describe someone who is good at their job",
    "filename": "05-Describe-someone-who-is-good-at-their-job.mp3",
    "text": "There's a particular place I absolutely love visiting - it's a small, family-run bookshop café called \"The Reading Corner\" located in the historic district of my city, about 20 minutes from my home. The shop occupies a beautifully restored two-story colonial building with exposed brick walls, wooden beams, and large windows that let in wonderful natural light. On the first floor, there are shelves packed with both new and second-hand books, while the second floor serves as a cozy café with mismatched vintage furniture, plants hanging from the ceiling, and the constant aroma of fresh coffee and baked goods. The atmosphere is incredibly warm and welcoming, and the owners, an elderly couple, know most of their regular customers by name. I discovered this place about three years ago while exploring the old quarter of the city, and since then, I've been visiting at least twice a month, usually on Saturday afternoons when I have more free time. When I go there, I follow a sort of ritual: I start by browsing the book shelves for about 30 minutes, often discovering hidden literary gems or old editions of classics. Then I head upstairs, order my favorite cappuccino and a slice of their homemade carrot cake, and settle into one of the comfortable armchairs near the window. I spend the next few hours either reading a book I've purchased or brought with me, or sometimes just people-watching and letting my mind wander. Occasionally, I strike up conversations with other regulars who share my love of books. The reason this place is so special to me goes beyond just the books and coffee. It represents an escape from the fast-paced, digital world we live in - there's no WiFi, which encourages genuine disconnection and reflection. The place evokes feelings of nostalgia and contentment, reminding me of simpler times. It's become my personal sanctuary where I can recharge mentally and emotionally, and I always leave feeling more centered and peaceful than when I arrived.",
    "word_count": 330,
    "file_size_kb": 681.75
  },
  {
    "id": 6,
    "topic": "Describe a beautiful city you have visited",
    "filename": "06-Describe-a-beautiful-city-you-have-visited.mp3",
    "text": "I'd like to talk about my espresso machine, which I purchased about a year ago but found surprisingly challenging to master. The problem was that I'm a real coffee enthusiast, and I was spending a fortune at coffee shops every day, sometimes up to $5-6 per cup. I decided to invest in a semi-automatic espresso machine, thinking it would pay for itself within a few months. However, I quickly discovered that making quality espresso is much more complex than I had anticipated. The difficulties came from multiple angles. First, there were numerous variables to control - the grind size, water temperature, extraction time, milk steaming technique, and pressure levels. My initial attempts were disastrous: the coffee was either too bitter from over-extraction, too weak, or the milk would either be too hot and scalded or not properly frothed. The instruction manual was technical and unhelpful, filled with jargon I didn't understand. I felt frustrated because I'd spent a significant amount of money on something I couldn't use properly. My learning process involved several strategies. I started by watching countless YouTube tutorials from professional baristas, taking detailed notes on their techniques. I also joined an online coffee enthusiast forum where experienced users answered my specific questions and troubleshot my problems. Most importantly, I committed to practicing daily, keeping a coffee journal where I recorded my settings and results for each attempt. Gradually, I began understanding how small adjustments affected the final taste. After about two months of dedicated practice, I finally started producing café-quality espresso consistently. The positive results have been remarkable. Not only have I saved hundreds of dollars, but I've also developed a genuine skill and deeper appreciation for the craft of coffee making. The experience taught me valuable lessons about patience and the learning curve involved in mastering any new skill. Now, making my morning espresso has become a meditative ritual I actually look forward to, and friends often comment that my coffee rivals what they get at professional cafés. This challenge transformed from a frustrating purchase into one of my most rewarding investments.",
    "word_count": 346,
    "file_size_kb": 809.86
  },
  {
    "id": 7,
    "topic": "Describe a hobby you enjoy",
    "filename": "07-Describe-a-hobby-you-enjoy.mp3",
    "text": "I'd like to talk about my hobby of photography, which has become a significant part of my life. I first got interested in photography about five years ago when a friend lent me his camera during a trip to the mountains. I was fascinated by how you could capture a moment and preserve it forever, and I realized I had a natural eye for composition. At first, I just used my phone camera and took random shots, but gradually I became more serious about learning proper techniques through online tutorials and photography books. These days, I'm quite dedicated to photography and have even invested in a professional DSLR camera with several lenses. I typically go out shooting at least twice a week, either early in the morning for sunrise shots or during the golden hour before sunset. I particularly enjoy landscape and street photography because they allow me to document the world around me. I've also joined a local photography club where we share techniques and organize photo walks together. Looking ahead, I'm planning to create an online portfolio and perhaps even exhibit my work at a local gallery next year. I might also start teaching basic photography to beginners, as I'd love to share this passion with others. Photography is significant to me because it's taught me to slow down and truly observe my surroundings, noticing beauty in everyday moments that I would have previously overlooked.",
    "word_count": 237,
    "file_size_kb": 486.0
  },
  {
    "id": 8,
    "topic": "Describe a sport you like to watch",
    "filename": "08-Describe-a-sport-you-like-to-watch.mp3",
    "text": "A movie that left a lasting impression on me is \"The Pursuit of Happyness,\" which I watched about four years ago during a particularly challenging period in my own life. At that time, I was struggling with my job search after graduation and feeling quite discouraged about my future prospects. One evening, feeling especially down, I decided to watch this film, not knowing how much it would resonate with me. The movie tells the true story of Chris Gardner, played brilliantly by Will Smith, a struggling salesman who becomes homeless while caring for his young son. The challenge he faces is heartbreaking - he needs to maintain his dignity and hope while dealing with extreme poverty, homelessness, and the pressure of being a single father. Despite having almost nothing, he secures an unpaid internship at a prestigious stockbrokerage firm, competing against highly educated candidates while secretly living in shelters and even subway bathrooms with his son. What really struck me was how the film portrayed Gardner's response to these circumstances. Rather than giving up or becoming bitter, he demonstrated incredible resilience and determination. The scenes showing him studying for his broker exam late at night in homeless shelters, all while ensuring his son felt loved and secure, were particularly moving. He protected his child from the harsh reality of their situation, turning their hardships into adventures and never losing sight of his goal to build a better life for them both. His positivity in the face of seemingly insurmountable odds was truly inspiring. The result of his perseverance was ultimately triumphant - Gardner not only completed the internship but also secured the full-time position, eventually building his own multi-million dollar brokerage firm. However, the movie's power isn't just in this happy ending, but in showing the daily struggle and sacrifice required to achieve it. The impact this film had on me was profound and continues to this day. It gave me perspective on my own struggles, making me realize that my challenges were manageable compared to what others face. More importantly, it taught me that success isn't about avoiding failure or hardship, but about how you respond to it and whether you maintain hope and keep working toward your goals despite setbacks. Whenever I face difficulties now, I remember Gardner's journey and find renewed motivation. The film changed my attitude from \"Why is this happening to me?\" to \"What can I learn from this and how can I overcome it?\" It's a reminder that circumstances don't define us; our responses to them do.",
    "word_count": 423,
    "file_size_kb": 896.77
  },
  {
    "id": 9,
    "topic": "Describe a song that has special meaning for you",
    "filename": "09-Describe-a-song-that-has-special-meaning-for-you.mp3",
    "text": "One of the most pressing environmental issues in my country is urban air pollution, particularly in major cities where millions of people live and work. The problem is severe enough that we often have to check air quality indices before going outside, and people wear masks not because of illness, but because of poor air quality. The causes of this problem are multiple and interconnected. The primary factor is the massive increase in vehicles on our roads - in the past two decades, car ownership has tripled, and the majority of these vehicles still run on conventional fuels rather than clean energy. Additionally, many factories and industrial plants operate with outdated technology that releases excessive emissions. Construction sites generate enormous amounts of dust, and during certain seasons, agricultural burning in surrounding regions contributes to the problem. Our geographic location in a valley also means pollutants tend to get trapped rather than dispersed. The impacts on daily life and health are significant and concerning. Respiratory illnesses, especially asthma and bronchitis, have increased dramatically among both children and elderly populations. On severely polluted days, schools sometimes cancel outdoor activities, and hospitals see a spike in emergency room visits. The visibility is reduced, affecting transportation safety, and there's growing evidence linking air pollution to cardiovascular problems and reduced life expectancy. Tourism has also suffered, as visitors are increasingly concerned about health risks. Addressing this crisis requires a comprehensive, multi-faceted approach. First, the government needs to invest heavily in public transportation infrastructure - expanding metro systems, introducing more electric buses, and creating dedicated bike lanes to reduce car dependency. Stricter emission standards for vehicles and industrial operations must be enforced with meaningful penalties for violations. We should offer tax incentives for companies that adopt clean technology and for individuals who purchase electric vehicles. Urban planning needs to incorporate more green spaces, as trees and plants naturally filter air pollutants. Education campaigns can raise public awareness about personal contributions to pollution and encourage behavioral changes. While these solutions require significant investment and political will, the cost of inaction is far higher - both in terms of public health expenses and quality of life for millions of citizens.",
    "word_count": 362,
    "file_size_kb": 904.92
  },
  {
    "id": 10,
    "topic": "Describe a law you think is good",
    "filename": "10-Describe-a-law-you-think-is-good.mp3",
    "text": "I'd like to discuss a law in my country that I believe is particularly beneficial - the mandatory parental leave policy that was introduced about five years ago. This law requires all employers to provide at least six months of paid parental leave, which can be shared between both parents, and it applies to companies of all sizes. I first learned about this law through news coverage when it was being debated in parliament, and since then I've witnessed its implementation and effects firsthand as several colleagues and friends have utilized it. The first major benefit of this law is that it promotes gender equality in the workplace and at home. Traditionally, only mothers took extended time off after having a baby, which often hurt their career progression. Now, with both parents entitled to leave and encouraged to share it, fathers are becoming more involved in early childcare, which helps break down gender stereotypes. This shared responsibility means women are less likely to face discrimination in hiring or promotion decisions, as employers know men might also take extended leave. The second significant advantage is the positive impact on child development and family bonding. Research consistently shows that children benefit enormously when parents can be present during the crucial early months of life. The law recognizes that those first six months are critical for establishing secure attachments, and it shouldn't be a luxury only available to wealthy families. Parents can focus on their newborn without the stress of financial hardship or fear of losing their jobs. Additionally, this policy has broader economic implications that might not be immediately obvious. While some businesses initially complained about the costs, studies have shown that generous parental leave actually increases employee loyalty and reduces turnover, which saves companies money in recruitment and training. Parents who feel supported by their employers tend to be more productive and committed when they return to work. The policy also supports population growth, which is crucial for our aging society - couples are more willing to have children when they know they'll receive adequate support. In conclusion, I believe this parental leave law is excellent because it balances multiple important considerations: children's wellbeing, gender equality, family stability, and even long-term economic health. It reflects a society that values both family life and professional development, recognizing that supporting parents ultimately benefits everyone.",
    "word_count": 391,
    "file_size_kb": 873.56
  }
]